# language: ru
# Диагностическая фича B6: выпадающий список поля Работа формы обработки.

Функционал: Диагностика выпадающего списка поля Работа

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Пауза с открытым выпадающим списком
	Когда я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю 'Планирование техники' 'Заполнение коэффициентов'
	Тогда открылось окно 'Заполнение коэффициентов по мощности'
	И в поле с именем 'Работа' я ввожу текст 'Тх_Тест'
	И я открываю выпадающий список с именем 'Работа'
	И выражение внутреннего языка 'Ложь' стало Истинно в течение 20 секунд
